In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({"col1":[1,2,3,4],
    "col2":[444,555,666,444],
    "col3":["abc","def","ghi","xyz"]})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
#반복되는 row를 제하고 unique한 row 값만 출력하도록 한다. 
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [7]:
df['col2'].nunique()

3

In [17]:
len(df['col2'].unique())

3

In [18]:
# value_counts() 라는 메소드는, 유니크한 value의 반복되는 숫자를 출력해줍니다. 
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [19]:
df1 = pd.DataFrame({'학생번호':[1,2,3,4,5,6,7,8],'좋아하는 간식':['햄버거', '피자', '김밥', '햄버거', '샐러드', '떡볶이', '샐러드', '샐러드'],'좋아하는 색깔':['red','blue','blue','yello', 'blue', 'violet', 'yello', 'red']})
df1

   학생번호 좋아하는 간식 좋아하는 색깔
0     1     햄버거     red
1     2      피자    blue
2     3      김밥    blue
3     4     햄버거   yello
4     5     샐러드    blue
5     6     떡볶이  violet
6     7     샐러드   yello
7     8     샐러드     red

In [22]:
df1['좋아하는 간식'].value_counts()

샐러드    3
햄버거    2
피자     1
김밥     1
떡볶이    1
Name: 좋아하는 간식, dtype: int64

In [23]:
df1['좋아하는 색깔'].value_counts()

blue      3
red       2
yello     2
violet    1
Name: 좋아하는 색깔, dtype: int64

In [24]:
df1['학생번호'].value_counts()

1    1
2    1
3    1
4    1
5    1
6    1
7    1
8    1
Name: 학생번호, dtype: int64

In [36]:
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [40]:
def a(var):
    return var*2

In [41]:
a(df['col1'])

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [42]:
df['col1'].apply(a)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [47]:
def p(i):
    return len(i)
df['col3'].apply(p)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [48]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [50]:
df1['좋아하는 간식'].apply(len)

0    3
1    2
2    2
3    3
4    3
5    3
6    3
7    3
Name: 좋아하는 간식, dtype: int64

In [59]:
# df.drop('col1',axis=1)

In [57]:
del df['col1']

In [58]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [60]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [63]:
df.index
#Stop은 그 앞 번호까지 진행하고 멈춘다는 뜻. 그래서 index 4는 없고, index 3에서 멈춘다.
#Step 은 간격, 즉 1씩 늘어난다.

RangeIndex(start=0, stop=4, step=1)

In [64]:
# ** sorting : 데이터 정렬
# 아래는 col2를 기준으로 작은 값부터 정렬을 해서 보여주는 내용이다. 

df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [66]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [67]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [68]:
df = pd.DataFrame({"col1":[1,2,3,np.nan],
    "col2":[np.nan,555,666,444],
    "col3":["abc","def","ghi","xyz"]})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [69]:
df.fillna('없음')

  col1   col2 col3
0  1.0     없음  abc
1  2.0  555.0  def
2  3.0  666.0  ghi
3   없음  444.0  xyz

In [70]:
df.fillna(df[0:])

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [81]:
df.fillna(df[['col1','col2']].mean())

   col1   col2 col3
0   1.0  555.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   2.0  444.0  xyz

In [85]:
data = {'A':['인문','인문','인문','정보','정보','정보'],
       'B':['1학년','1학년','2학년','2학년','1학년','1학년'],
        'C':['여','남','여','남','여','남'],
       'D':[90,80,75,50,100,40]}
df = pd.DataFrame(data)

In [86]:
df

    A    B  C    D
0  인문  1학년  여   90
1  인문  1학년  남   80
2  인문  2학년  여   75
3  정보  2학년  남   50
4  정보  1학년  여  100
5  정보  1학년  남   40

In [87]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          남      여
A  B
인문 1학년  80.0   90.0
   2학년   NaN   75.0
정보 1학년  40.0  100.0
   2학년  50.0    NaN